liguijia/Kaiser-CtrBoard-STM32H730VBT6/example/8.IMU/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED4_Pin GPIO_PIN_0
#define LED4_GPIO_Port GPIOC
#define LED3_Pin GPIO_PIN_2
#define LED3_GPIO_Port GPIOC
#define IMU_HEAT_Ctrl_Pin GPIO_PIN_0
#define IMU_HEAT_Ctrl_GPIO_Port GPIOB
#define IMU_INT1_GYRO_Pin GPIO_PIN_7
#define IMU_INT1_GYRO_GPIO_Port GPIOE
#define IMU_INT1_ACCEL_Pin GPIO_PIN_8
#define IMU_INT1_ACCEL_GPIO_Port GPIOE
#define IMU_CS1_GYRO_Pin GPIO_PIN_9
#define IMU_CS1_GYRO_GPIO_Port GPIOE
#define IMU_CS1_ACCEL_Pin GPIO_PIN_10
#define IMU_CS1_ACCEL_GPIO_Port GPIOE
#define IMU_SCK_Pin GPIO_PIN_12
#define IMU_SCK_GPIO_Port GPIOE
#define IMU_MISO_Pin GPIO_PIN_13
#define IMU_MISO_GPIO_Port GPIOE
#define IMU_MOSI_Pin GPIO_PIN_14
#define IMU_MOSI_GPIO_Port GPIOE
#define BUZZER_Pin GPIO_PIN_14
#define BUZZER_GPIO_Port GPIOD
#define LED2_Pin GPIO_PIN_15
#define LED2_GPIO_Port GPIOD
#define LED1_Pin GPIO_PIN_7
#define LED1_GPIO_Port GPIOC
#define KEY_Pin GPIO_PIN_1
#define KEY_GPIO_Port GPIOD
#define KEY_EXTI_IRQn EXTI1_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
